VV_cases/V2_thermal/results/study_v2a/runs/004_data_v2a_ogrid_cylinder_validation/simulations/Re100_ogrid/openfoam_setup/system/setExprFieldsDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      setExprFieldsDict;
}

readFields ( U );

expressions
(
    U
    {
        field U;
        create no;
        dimensions [0 1 -1 0 0 0 0];
        expression
        #{
            vector(
                0.126315061,
                0.000631575*exp(-pow((pos().x()-0.006000000)/0.018000000, 2.0)
                                  -pow((pos().y()-0.003000000)/0.009000000, 2.0)),
                0
            )
        #};
    }
);
